22-rails-sessions-cookies/app/controllers/application_controller.rb

SELECT  "nachos".* FROM "nachos" WHERE "nachos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def find_the_nachos
    @nachos_in_my_cart = Nacho.find(cart)