22-rails-sessions-cookies/app/controllers/cart_controller.rb

  def update
    # byebug
    n = Nacho.find(params[:id])
---
SELECT  "nachos".* FROM "nachos" WHERE "nachos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]